# Pandas

In [1]:
import numpy as np
import pandas as pd

## 데이터프레임

### 생성

In [2]:
data = {
    '국어': [80, 90, 70, 30],
    '영어': [90, 70, 60, 40],
    '수학': [90, 60, 80, 70]
}
index = ['춘향','몽룡','향단','방자']
df = pd.DataFrame(data=data, index=index)

In [3]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [4]:
np.random.seed(2021)
data = np.random.randint(40, 100, 12).reshape(4,3)
columns = ['국어','영어','수학']
df2 = pd.DataFrame(data, index=index, columns=columns)
df2

    국어  영어  수학
춘향  92  61  97
몽룡  40  85  70
향단  62  84  67
방자  69  61  69

In [5]:
df3 = pd.DataFrame(data)
df3.index = index
df3.columns = columns
df3

    국어  영어  수학
춘향  92  61  97
몽룡  40  85  70
향단  62  84  67
방자  69  61  69

### 파일 입출력

In [6]:
%%writefile sample1.csv
c1,c2,c3
1,1.11,one
2,2.22,two
3,3.33,three

Writing sample1.csv

In [7]:
!cat sample1.csv

c1,c2,c3
1,1.11,one
2,2.22,two
3,3.33,three

In [8]:
df = pd.read_csv('sample1.csv')
df

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

In [9]:
df.to_csv('sample2.csv')

In [10]:
!cat sample2.csv

,c1,c2,c3
0,1,1.11,one
1,2,2.22,two
2,3,3.33,three

In [12]:
df = pd.read_csv('sample2.csv')
df

   Unnamed: 0  c1    c2     c3
0           0   1  1.11    one
1           1   2  2.22    two
2           2   3  3.33  three

In [14]:
del df['Unnamed: 0']
df

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

In [15]:
df.to_csv('sample3.csv', index=False)

In [16]:
!cat sample3.csv

c1,c2,c3
1,1.11,one
2,2.22,two
3,3.33,three

In [18]:
df.to_csv('sample4.tsv', sep='\t', index=False)     # Tab Separated Values

In [20]:
df = pd.read_csv('sample4.tsv', sep='\t')
df

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three